vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1176_DFP.pdsc
              // setup debug port for CM4
              __ap=1;
              Sequence("dpstart");
            </block>
          </sequence>
          <sequence Pname="cm7" name="DebugPortStart">
            <block>
              __var reg;
              __var start;
              
              Sequence("dpstart");
              
              //prepare trap code for CM7
              start = 0x2001FF00;
              WriteAP(0x4, start);
              WriteAP(0xC, start + 0x20);
              
              WriteAP(0x4, start + 4);
              WriteAP(0xC, 0x23105);
              
              WriteAP(0x4, 0x40C0C068);
              WriteAP(0xC, start &gt;&gt; 7);
              
              //change reset mode of cm7
              WriteAP(0x4, 0x40c04004);
              reg = ReadAP(0xC);
              reg |= (0x3 &lt;&lt; 12);
              WriteAP(0xC, reg);
            </block>
          </sequence>
        </sequences>
        <memory name="ROMCP" start="0x00200000" size="0x040000" access="rx" default="1"/>
        <memory name="SRAM_OC1" start="0x20240000" size="0x080000" access="rw" default="1"/>
        <memory name="SRAM_OC2" start="0x202c0000" size="0x080000" access="rw" default="1"/>
        <memory name="SRAM_OC_ECC1" start="0x20340000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM_OC_ECC2" start="0x20350000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM_OC_cm7" start="0x20360000" size="0x020000" access="rw" default="1"/>
        <algorithm name="devices/MIMXRT1176/arm/MIMXRT117x_QuadSPI_4KB_SEC.FLM" start="0x30000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MIMXRT1176/arm/MIMXRT117x_QuadSPI_4KB_SEC_Alias.FLM" start="0x08000000" size="0x01000000" RAMstart="0x1ffe0000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MIMXRT1176/arm/MIMXRT117x_64MB_QuadSPI_4KB_SEC.FLM" start="0x30000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MIMXRT1176/arm/MIMXRT117x_64MB_QuadSPI_4KB_SEC_Alias.FLM" start="0x08000000" size="0x04000000" RAMstart="0x1ffe0000" RAMsize="0x00008000" default="1"/>
        <debug svd="devices/MIMXRT1176/MIMXRT1176_cm4.xml" Pname="cm4" __dp="0" __ap="1"/>
        <debug svd="devices/MIMXRT1176/MIMXRT1176_cm7.xml" Pname="cm7" __dp="0" __ap="0"/>
        <variant Dvariant="MIMXRT1176DVMAA">
          <compile Pname="cm4" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176DVMAA_cm4"/>
          <compile Pname="cm7" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176DVMAA_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1176AVM8A">
          <compile Pname="cm4" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176AVM8A_cm4"/>
          <compile Pname="cm7" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176AVM8A_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1176CVM8A">
          <compile Pname="cm4" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176CVM8A_cm4"/>
          <compile Pname="cm7" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176CVM8A_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1176DVMAB">
          <compile Pname="cm4" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176DVMAB_cm4"/>
          <compile Pname="cm7" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176DVMAB_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1176AVM8B">
          <compile Pname="cm4" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176AVM8B_cm4"/>
          <compile Pname="cm7" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176AVM8B_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1176CVM8B">
          <compile Pname="cm4" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176CVM8B_cm4"/>
          <compile Pname="cm7" header="devices/MIMXRT1176/fsl_device_registers.h" define="CPU_MIMXRT1176CVM8B_cm7"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT1176.internal_condition">
      <accept Dname="MIMXRT1176AVM8A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176AVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176CVM8A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176CVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176DVMAA" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1176DVMAB" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="allOf.device=MIMXRT1176.internal_condition">
      <require condition="device.MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT1176.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.sai_edma, device=MIMXRT1176.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai_edma, device=MIMXRT1176.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MIMXRT1176.internal_condition"/>
    </condition>
