vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1176_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
