vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1176_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1176_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT1176_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1176/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm4.condition_id" category="header" name="devices/MIMXRT1176/MIMXRT1176_cm4.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm4.condition_id" category="header" name="devices/MIMXRT1176/MIMXRT1176_cm4_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm4.condition_id" category="header" name="devices/MIMXRT1176/MIMXRT1176_cm4_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ADC_ETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_LDO_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_LDO_SNVS_DIG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_MISC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_OSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_PMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ANADIG_TEMPSENSOR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ASRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_AUDIO_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CAAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CAN_WRAPPER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CCM_OBS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_CSI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DCDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DCIC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DMAMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DSI_HOST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DSI_HOST_APB_PKT_IF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DSI_HOST_DPI_INTFC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_DSI_HOST_NXP_FDSOI28_DPHY_INTFC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_EMVSIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ENC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ENET_QOS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_ETHERNET_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_FLEXRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_GPC_CPU_MODE_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_GPC_SET_POINT_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_GPC_STBY_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_GPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IEE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IEE_APC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IOMUXC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IOMUXC_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IOMUXC_LPSR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IOMUXC_LPSR_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IOMUXC_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IOMUXC_SNVS_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_IPS_DOMAIN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_KEY_MANAGER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_KPP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_LCDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_LCDIFV2.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_LMEM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_MECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_MIPI_CSI2RX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_MMCAU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_OSC_RC_400M.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PGMC_BPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PGMC_CPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PGMC_MIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PGMC_PPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PHY_LDO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PIT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_PXP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_RDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_RDC_SEMAPHORE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_RTWDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SEMA4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SEMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SPDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SSARC_HP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_SSARC_LP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_TMPSNS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_VIDEO_MUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_VIDEO_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_VMBANDGAP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_WDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_XBARA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_XBARB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_XECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1176/periph/PERI_XRDC2.h" projectpath="device/periph"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="header" name="devices/MIMXRT1176/MIMXRT1176_cm7.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="header" name="devices/MIMXRT1176/MIMXRT1176_cm7_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="header" name="devices/MIMXRT1176/MIMXRT1176_cm7_features.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1176/"/>
        <file category="include" name="devices/MIMXRT1176/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1176/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1176/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="1.0.0" condition="device.boot_header.condition_id">
      <description>Device Boot Header</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1176/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="header" name="devices/MIMXRT1176/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1176/xip/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1176_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1176_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm4_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm4_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm4_ram.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm4_sdram.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm4_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm4_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm4_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm4_ram.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm4_sdram.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm4_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm4_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm4_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm4_ram.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm4_sdram.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm4_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm7_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm7_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm7_ram.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm7_sdram.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/arm/MIMXRT1176xxxxx_cm7_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1176/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm7_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm7_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm7_ram.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm7_sdram.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/gcc/MIMXRT1176xxxxx_cm7_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1176/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm7_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm7_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm7_ram.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm7_sdram.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1176xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1176/iar/MIMXRT1176xxxxx_cm7_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1176/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1176" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1176</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1176/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1176/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1176/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1176/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1176/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1176/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1176/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1176/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1176/project_template/"/>
      </files>
    </component>
